'''номер у комментария = номер задания '''


#1 номер
'''
Маше для защиты курсовой работы нужно написать программу для расчёта экономической модели по формуле. Как записать саму формулу в программу, она не знает, у неё есть только начальные значения. Поэтому Маша решила просто заплатить Егору, чтобы тот написал её быстрее.

Дана программа:



a = 8

b = 10

c = 12

d = 18



Продолжите программу: переведите выражение с математического языка на язык Python, запишите его в переменную res и выведите результат.

Выражение:

'''


'''
a = 8
b = 10
c = 12
d = 18


print("ответ:")
print(2)
print(2**3)

print((((-3+(a*a))*b)-(2**3))/(c-(2*d)))

'''

#2

'''Наде дали задание сформировать финансовый отчёт за последние 20 лет
по полугодиям.
Нужно сумму дохода первых двух кварталов поделить
на сумму последних двух кварталов, чтобы понять динамику роста
или падения дохода. И так за каждый год.
Надя решила, что быстрее будет написать простую программу,
которая сделает всё за неё.

Запросите у пользователя четыре числа.
Отдельно сложите два первых и отдельно — два вторых.
Разделите первую сумму на вторую.
Выведите результат на экран.
'''








